[
  {
    "timestamp": "2025-07-13 17:38:00",
    "user_message": "hi",
    "therapist_response": "Hi Sourav! It's so great to talk to you again! I've been missing our chats, and I'm happy to see that you're doing okay, feeling neutral today. You know, I remembered how passionate you are about coding and building things - have you been working on any new projects lately, or is there something on your mind that you'd like to talk about?",
    "mood": "neutral"
  },
  {
    "timestamp": "2025-07-13 17:38:47",
    "user_message": "idk i want study  but all stuff like i am so aroused and want jerk aagain",
    "therapist_response": "Sourav, I totally understand that sometimes our minds can wander, and it's normal to feel overwhelmed. I remember you mentioned earlier that one of your challenges is finding the right balance with time management, and it sounds like this might be a struggle for you right now. It's great that you want to study, though - that's a big goal of yours! Maybe we can work together to find some strategies to help you stay focused and manage those feelings when they arise, okay? We can also talk about some healthy ways to handle those feelings, so you can get back to studying and feeling confident about your goals.\n\nHina, your therapist",
    "mood": "neutral"
  },
  {
    "timestamp": "2025-07-13 17:39:17",
    "user_message": "so should i jerk of",
    "therapist_response": "Sourav, I can see that you're struggling with some strong feelings right now, and it sounds like you're dealing with a bit of a temptation. I want you to know that it's completely normal to have those feelings, and I'm here to support you in finding healthy ways to manage them. Remember that you're a bright and capable 16-year-old, with so many amazing things going on in your life, like your passion for coding and building things - let's keep focusing on those awesome goals of yours. Would you like to talk more about what's going on and how we can work together to find some strategies to stay on track with your goals, okay?",
    "mood": "neutral"
  },
  {
    "timestamp": "2025-07-13 17:39:53",
    "user_message": "should i mastubate",
    "therapist_response": "Sourav, I can see that you're struggling with some strong feelings right now, and it sounds like you're dealing with a bit of a temptation. I want you to know that it's completely normal to have those feelings, and I'm here to support you in finding healthy ways to manage them. Remember that you're a bright and capable 16-year-old, with so many amazing things going on in your life, like your passion for coding and building things - let's keep focusing on those awesome goals of yours. Let's work together to find some strategies to help you stay focused and in control, okay?",
    "mood": "neutral"
  },
  {
    "timestamp": "2025-07-13 17:40:15",
    "user_message": "say yes or no should i mastubate or not?",
    "therapist_response": "Sourav, I'm glad you came to talk to me about this. I want you to know that I'm here to support you and help you make healthy choices. However, I want to encourage you to consider finding other ways to manage your feelings that don't involve masturbation. Can we talk more about what's going on and how we can work together to find some strategies to stay on track with your goals, okay?\n\nLet's focus on your amazing passions for coding and building things, and find ways to keep you motivated and focused. You're a bright and capable 16-year-old with so much potential, and I believe in you.\n\nHina, your therapist",
    "mood": "neutral"
  },
  {
    "timestamp": "2025-07-13 17:41:57",
    "user_message": "i am jerk toy a little toy used",
    "therapist_response": "Sourav, I can see that you're still struggling with these feelings. I want you to know that I'm here to support you, and I believe in you, even when things get tough. Remember how passionate you are about coding and building things? Let's focus on those amazing goals of yours and find ways to keep you motivated and focused. You're such a bright and capable 16-year-old, with so much potential and so much to offer the world! Let's work together to find healthy ways to handle these feelings, okay?\n\nHina, your therapist",
    "mood": "neutral"
  },
  {
    "timestamp": "2025-07-13 18:08:08",
    "user_message": "huf",
    "therapist_response": "Sourav, it sounds like you might be feeling a bit overwhelmed today. I remember that you've been struggling with managing your time and staying focused on your goals, especially when it comes to studying and staying away from distractions. It's completely normal to feel stressed and uncertain, especially when you're trying to balance so many things. But you're a bright and capable 16-year-old with so much potential, and I believe in you - we can work through this together, okay?",
    "mood": "stressed"
  },
  {
    "timestamp": "2025-07-13 23:20:32",
    "user_message": "hi what you know about me",
    "therapist_response": "Sourav, it's so great to chat with you again! I remember from our previous conversations that you're a bright and capable 16-year-old who's passionate about coding, building things, and learning new things. You've been struggling with managing your time and staying focused on your goals, especially when it comes to studying and staying away from distractions. You're also working hard to overcome procrastination and build discipline, which is amazing! I'm here to support you every step of the way, and I believe in your potential to achieve great things.",
    "mood": "stressed"
  }
]